; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 296835 1 2 4 5 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image3 - mode
	thermograph2 - mode
	image1 - mode
	spectrograph0 - mode
	Star0 - direction
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	Star2 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(supports instrument0 image3)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
)
(:goal (and
	(pointing satellite0 Phenomenon7)
	(have_image Planet5 image1)
	(have_image Phenomenon6 spectrograph0)
	(have_image Phenomenon7 thermograph2)
	(have_image Star8 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 5
2. (turn_to satellite0 star2 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star2)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 star8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star8)
   goals met: 0 of 5
5. (take_image satellite0 star8 instrument0 image1)
   added: (have_image star8 image1)
   goals met: 1 of 5
6. (turn_to satellite0 planet5 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet5)
   goals met: 1 of 5
7. (take_image satellite0 planet5 instrument0 image1)
   added: (have_image planet5 image1)
   goals met: 2 of 5
8. (turn_to satellite0 phenomenon6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 5
9. (take_image satellite0 phenomenon6 instrument0 spectrograph0)
   added: (have_image phenomenon6 spectrograph0)
   goals met: 3 of 5
10. (turn_to satellite0 phenomenon7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon7)
   goals met: 4 of 5
11. (take_image satellite0 phenomenon7 instrument0 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 5 of 5
